{
    "B2": "Wir verwenden Cookies und ähnliche Techniken, um Besucher wiederzuerkennen und ihre Einstellungen zu speichern. Wir können diese Technologien auch verwenden, um die Effektivität von Werbekampagnen zu messen, Werbung gezielt zu platzieren und den Traffic der Website zu analysieren. Einige dieser Technologien sind für die ordnungsgemäße Funktion des Dienstes oder der Website unerlässlich und können nicht deaktiviert werden. Andere sind optional, dienen aber dazu, die Benutzererfahrung auf verschiedene Weise zu verbessern.\n\nIn Zusammenarbeit mit unseren Partnern speichern wir Informationen auf den Geräten der Benutzer und/oder greifen darauf zu. Zu diesen Informationen zählen unter anderem IP-Adressen, eindeutige Kennungen und in Cookies gespeicherte Browserdaten, um persönliche Daten zu verarbeiten. Sie können Ihre Einstellungen verwalten, indem Sie in der Fußzeile der Seite auf die Option „Einstellungen verwalten“ klicken. Gehen Sie bitte auf unsere Seite für Anbieter, um Fälle zu prüfen, in denen unsere Partner ein berechtigtes Interesse an der Nutzung Ihrer Daten geltend machen, oder um der Nutzung zu widersprechen.",
    "B3": "Anbieter mit Einwilligung",
    "B4": "Anbieter mit berechtigtem Interesse",
    "B5": "Genutzte Anbieter",
    "B6": "Verkauf und Weitergabe von Daten und gezielte Werbung",
    "B7": "Anbieter, die wir zu diesem Zweck nutzen",
    "B8": "X Anbieter",
    "B9": "Offenlegung berechtigtes Interesse",
    "B10": "Datenkategorien",
    "B11": "Aufbewahrungsdauer",
    "B12": "X Tag(e)",
    "B13": "Zwecke",
    "B14": "Zweck X",
    "B15": "${name} speichert Cookies mit einer maximalen Speicherdauer von etwa so vielen Tagen:",
    "B16": "Diese Cookies können erneuert werden.",
    "B17": "Dieser Anbieter verwendet auch andere Methoden wie den „lokalen Speicher“, um Informationen auf Ihrem Gerät zu speichern und darauf zuzugreifen.",
    "B18": "${name} verwendet Methoden wie den „lokalen Speicher“, um Informationen auf Ihrem Gerät zu speichern und darauf zuzugreifen.",
    "B19": "Andere Anbieter"
}