{
    "B2": "Utilizamos cookies y métodos similares para reconocer a los visitantes y recordar sus preferencias. También podemos utilizar estas tecnologías para medir la eficacia de las campañas publicitarias, orientar los anuncios de forma selectiva y analizar el tráfico del sitio web. Algunas de estas tecnologías son esenciales para garantizar el funcionamiento correcto del servicio o del sitio web y no se pueden desactivar, mientras que otras son opcionales pero sirven para mejorar la experiencia del usuario de diversas maneras.\n\nNosotros, en colaboración con nuestros socios, almacenamos y/o accedemos a información en el dispositivo de un usuario, p. ej. direcciones IP, identificadores únicos y datos de navegación almacenados en cookies, con el fin de tratar datos personales. Tiene la opción de administrar sus preferencias seleccionando la opción «Administrar preferencias» que figura en el pie de página. Para revisar u oponerse a los casos en los que nuestros socios afirman tener un interés legítimo en utilizar sus datos, visite nuestra página de proveedores.",
    "B3": "Proveedores que utilizan el consentimiento",
    "B4": "Proveedores que utilizan el interés legítimo",
    "B5": "Proveedores utilizados",
    "B6": "Venta de datos, intercambio y publicidad dirigida",
    "B7": "Proveedores que utilizamos para este fin",
    "B8": "X proveedor(es)",
    "B9": "Revelación de interés legítimo",
    "B10": "Categorías de datos",
    "B11": "Conservación",
    "B12": "X día(s)",
    "B13": "Entre las finalidades se incluyen",
    "B14": "Finalidad X",
    "B15": "${name} almacena cookies con una duración máxima de aproximadamente este número de días:",
    "B16": "Estas cookies se pueden actualizar.",
    "B17": "Este proveedor también utiliza otros métodos como el «almacenamiento local» para almacenar y acceder a información en su dispositivo.",
    "B18": "${name} utiliza métodos como el «almacenamiento local» para almacenar y acceder a información en su dispositivo.",
    "B19": "Otros proveedores"
}