{
    "B2": "We gebruiken cookies en vergelijkbare methoden om bezoekers te herkennen en hun voorkeuren te onthouden. We kunnen deze technologieën ook gebruiken om de effectiviteit van advertentiecampagnes te meten, gericht te adverteren en websiteverkeer te analyseren. Sommige van deze technologieën zijn essentieel voor de juiste werking van de dienst of website en kunnen niet uitgeschakeld worden, terwijl andere optioneel zijn maar de gebruikerservaring op verschillende manieren verbeteren.\n\nWij, in samenwerking met onze partners, bewaren en gebruiken informatie op het apparaat van een gebruiker, inclusief maar niet beperkt tot IP-adressen, unieke identificatiegegevens en in cookies bewaarde browsegegevens, om persoonlijke gegevens te verwerken. U kunt uw voorkeuren beheren door de optie 'Voorkeuren beheren' in de voettekst van de pagina te selecteren. Ga naar onze leverancierspagina als u wilt zien in welke gevallen onze partners zich beroepen op een gerechtvaardigd belang om uw gegevens te gebruiken of als u daar bezwaar tegen wilt maken.",
    "B3": "Leveranciers die toestemming gebruiken",
    "B4": "Leveranciers die gerechtvaardigd belang gebruiken",
    "B5": "Gebruikte leveranciers",
    "B6": "Gegevens verkopen, delen en gerichte advertenties",
    "B7": "Leveranciers die we voor dit doel gebruiken",
    "B8": "X leverancier(s)",
    "B9": "Verklaring gerechtvaardigd belang",
    "B10": "Gegevenscategorieën",
    "B11": "Bewaartermijn",
    "B12": "X dag(en)",
    "B13": "Doelen zijn onder andere",
    "B14": "Doel X",
    "B15": "${name} bewaart cookies gedurende een maximale termijn van ongeveer dit aantal dagen:",
    "B16": "Deze cookies kunnen vernieuwd worden.",
    "B17": "Deze leverancier gebruikt ook andere methoden zoals 'lokale opslag' om informatie op uw apparaat te bewaren en te gebruiken.",
    "B18": "${name} gebruikt methoden zoals 'lokale opslag' om informatie op uw apparaat te bewaren en te gebruiken.",
    "B19": "Andere leveranciers"
}