{
    "B2": "Sīkfaili un citas saistītās tehnoloģijas palīdz mums identificēt apmeklētājus un saglabāt viņu preferences. Šīs tehnoloģijas varam izmantot arī, lai mērķētu reklāmas, izmērītu reklāmas kampaņu panākumu līmeni un pārbaudītu vietnes trafiku. Lai gan dažas no šīm tehnoloģijām nav obligātas, tomēr tās palīdz uzlabot lietotāja pieredzi dažādos veidos, citas savukārt ir nepieciešamas, lai garantētu, ka pakalpojums vai vietne darbojas, atbilstošā veidā, un tās nedrīkst atspējot.\n\nLai apstrādātu personas datus, mēs kopā ar partneriem saglabājam un/vai piekļūstam informācijai lietotāja ierīcē, piemēram, IP adresēm, unikālajiem identifikatoriem un sīkfailos saglabātajiem pārlūkošanas datiem. Izvēloties opciju \"Pārvaldīt iestatījumus\", kas atrodama lapas kājenē, varat kontrolēt savus iestatījumus. Lūdzu, apmeklējiet mūsu pārdevēju/ pakalpojumu sniedzēju lapu, lai pārbaudītu vai iebilstu pret jebkādiem gadījumiem, kad mūsu partneri apgalvo, ka viņiem ir leģitīmais pamats izmantot jūsu datus.",
    "B3": "Pārdevēji/ pakalpojumu sniedzēji, kas izmanto piekrišanu",
    "B4": "Pārdevēji/ pakalpojumu sniedzēji, kas izmanto leģitīmās intereses",
    "B5": "Iesaistītie pārdevēji/ pakalpojumu sniedzēji",
    "B6": "Datu pārdošana, kopīgošana un mērķtiecīga reklamēšana",
    "B7": "Pārdevēji/ pakalpojumu sniedzēji, kurus mēs izmantojam šim nolūkam",
    "B8": "X pārdevējs(-i)/ pakalpojumu sniedzējs(-i)",
    "B9": "Leģitīmo interešu izpaušana",
    "B10": "Datu kategorijas",
    "B11": "Ieturēšana",
    "B12": "X diena(s)",
    "B13": "Mērķi iekļauj",
    "B14": "Mērķis X",
    "B15": "${name} saglabā sīkdatnes, kuru maksimālais dienu ilgums ir aptuveni:",
    "B16": "Šīs sīkdatnes var tikt atsvaidzinātas.",
    "B17": "Turklāt šis pārdevējs/pakalpojumu sniedzējs saglabā un izgūst datus no jūsu ierīces, izmantojot papildu metodes, piemēram, \"vietējo krātuvi\".",
    "B18": "${name} izmanto tādas metodes kā \"Vietējā krātuve\", lai saglabātu un piekļūtu informācijai jūsu ierīcē.",
    "B19": "Citi pārdevēji/pakalpojumu sniedzēji"
}