{
    "B2": "Nous utilisons des témoins et des méthodes similaires pour reconnaitre les visiteurs et se souvenir de leurs préférences. Nous pouvons également utiliser ces technologies pour calibrer l’efficacité des campagnes publicitaires, des publicités ciblées et analyser le trafic sur le site web. Certaines de ces technologies sont essentielles pour assurer le propre fonctionnement du service ou du site web et ne peuvent être déactivées, tandis que d’autres sont optionnelles mais servent à améliorer l’expérience de l’utilisateur de diverses façons.\n\nEn collaboration avec nos partenaires, nous conservons et/ou accédons à l’information contenue sur l’appareil d’un utilisateur, y compris, mais sans s’y limiter, les adresses IP, les identifiants uniques et les données de navigation stockées dans les témoins, à des fins de traitement des données personnelles. Vous avez l’option de gérer vos préférences en sélectionnant l’option « Gérer les préférences » située au pied de page. Pour consulter ou refuser les instances pour lesquelles nos partenaires font valoir un intérêt légitime lors de l’utilisation de vos données, veuillez visiter notre page sur les fournisseurs.",
    "B3": "Fournisseurs utilisant le consentement",
    "B4": "Fournisseurs utilisant l’intérêt légitime",
    "B5": "Fournisseurs utilisés",
    "B6": "Ventes de données, partage et publicité ciblée",
    "B7": "Fournisseurs utilisés dans ce but",
    "B8": "X fournisseur(s)",
    "B9": "Divulgation d’un intérêt légitime",
    "B10": "Catégories de données",
    "B11": "Rétention",
    "B12": "X jour(s)",
    "B13": "Les objectifs incluent",
    "B14": "Objectif X",
    "B15": "${name} conserve les témoins sur une durée maximale de tant de jours :",
    "B16": "Ces témoins peuvent être rafraîchis.",
    "B17": "Ce fournisseur utilise également d’autres méthodes comme « le stockage local » pour conserver et accéder à l’information sur votre appareil.",
    "B18": "${name} utilise des méthodes comme le « stockage local » pour conserver et accéder à l’information sur votre appareil.",
    "B19": "Autres fournisseurs"
}