{
    "B2": "Ми використовуємо файли cookie та подібні методи, щоб розпізнавати відвідувачів і запам'ятовувати їхні уподобання. Ми також можемо використовувати ці технології для оцінки ефективності рекламних кампаній, таргетування реклами та аналізу відвідуваності вебсайтів. Деякі з цих технологій необхідні для забезпечення належного функціонування сервісу або вебсайту і не можуть бути відключені, тоді як інші є необов’язковими, проте різними способами слугують для покращення користувацького досвіду.\n\nУ співпраці з нашими партнерами ми зберігаємо та/або отримуємо доступ до інформації на пристрої користувача, включаючи, зокрема, IP-адреси, унікальні ідентифікатори та дані перегляду, що зберігаються в файлах cookie, з метою обробки персональних даних. Ви можете керувати своїми налаштуваннями, вибравши опцію «Керувати налаштуваннями», розташовану в нижньому колонтитулі сторінки. Щоб переглянути або заперечити проти випадків, коли наші партнери заявляють про законний інтерес у використанні ваших даних, завітайте на сторінку наших постачальників.",
    "B3": "Постачальники, які використовують процес згоди",
    "B4": "Постачальники, які використовують право законного інтересу",
    "B5": "Залучені постачальники",
    "B6": "Продаж, обмін даними та таргетована реклама",
    "B7": "Постачальники, яких ми для цього залучаємо",
    "B8": "X постачальник(-ів)",
    "B9": "Розкриття інформації про законні інтереси",
    "B10": "Категорії даних",
    "B11": "Зберігання",
    "B12": "X день(днів)",
    "B13": "Цілі включають",
    "B14": "Ціль X",
    "B15": "${name} зберігає файли cookie з максимальною тривалістю приблизно стільки днів:",
    "B16": "Ці файли cookie можуть бути оновлені.",
    "B17": "Цей постачальник також використовує інші методи, як-от «локальне сховище» для зберігання та доступу до інформації на вашому пристрої.",
    "B18": "${name} використовує такі методи, як «локальне сховище» для зберігання та доступу до інформації на вашому пристрої.",
    "B19": "Інші постачальники"
}