{
    "B2": "Nous utilisons des cookies et des méthodes similaires pour reconnaître les visiteurs de ce site et nous souvenir de leurs préférences. Nous pouvons également utiliser ces technologies pour mesure l’efficacité des campagnes publicitaires et des publicités ciblées, et pour analyser le trafic sur le site Web. Certaines de ces technologies sont indispensables au bon fonctionnement du service ou du site Web et ne peuvent pas être désactivées, tandis que d’autres sont facultatives, mais permettent d’améliorer l’expérience de l’utilisateur de multiples façons.\n\nEn collaboration avec nos partenaires, nous stockons ou accédons aux informations sur l’appareil d’un utilisateur, y compris, mais sans s’y limiter, les adresses IP, les identifiants uniques et les données de navigation stockées par les cookies, afin de traiter les renseignements personnels.  Vous avez la possibilité de gérer vos préférences en sélectionnant l’option « Gérer les préférences » située en pied de page. Pour consulter ou refuser les instances pour lesquelles nos partenaires invoquent un intérêt légitime d’utilisation de vos données, veuillez vous reporter à la page de nos fournisseurs.",
    "B3": "Fournisseurs utilisant le consentement",
    "B4": "Fournisseurs utilisant l’intérêt légitime",
    "B5": "Fournisseurs utilisés",
    "B6": "Ventes de données, partage et publicité ciblée",
    "B7": "Fournisseurs que nous utilisons à cette fin",
    "B8": "X fournisseur(s)",
    "B9": "Avis sur l’intérêt légitime",
    "B10": "Catégories de données",
    "B11": "Rétention",
    "B12": "X jour(s)",
    "B13": "Les finalités incluent",
    "B14": "Finalité X",
    "B15": "${name} stocke les cookies pour une durée maximale approximative du nombre de jours suivants :",
    "B16": "Ces cookies peuvent être actualisés.",
    "B17": "Ce fournisseur utilise également d’autres méthodes de « stockage local » pour stocker les informations présentes sur votre appareil et y accéder.",
    "B18": "${name} utilise des méthodes comme le « stockage local » pour stocker les informations présentes sur votre appareil et y accéder.",
    "B19": "Autres fournisseurs"
}