{
    "B2": "Noi folosim module cookie și metode similare de recunoaștere a vizitatorilor și a reține preferințele lor. De asemenea, folosim aceste tehnologii pentru a cuantifica eficacitatea campaniilor de promovare, reclamele țintite și a analiza traficul de pe site-ul web. O parte dintre aceste tehnologii sunt esențiale pentru a garanta funcționarea corespunzătoare a serviciului sau a site-ului web și nu pot fi dezactivate, în timp ce altele sunt opționale, dar servesc la îmbunătățiraea experienței utilizatorului în diverse moduri.\n\nNoi, în colaborare cu partenerii noștri, stocăm și/sau accesăm informațiile de pe un dispozitiv al utilizatorului, inclusiv, dar fără a se limita la adresele IP, identificatorii unici și explorarea datelor stocate în modulele cookie, pentru a prelucra datele dvs. cu caracter personal. Aveți opțiunea de a vă gestiona preferințele selectând opțiunea „Gestionare preferințe” situată în subsolul paginii. Pentru a revizui sau a vă opune instanțelor în care partenerii noștri declară un interes legitim vis-a-vis de utilizarea datelor dvs., vizitați pagina noastră de furnizori.",
    "B3": "Furnizori care folosesc consimțământul",
    "B4": "Furnizori care folosesc interesul legitim",
    "B5": "Furnizori utilizați",
    "B6": "Vânzări de date, partajare și publicitate țintită",
    "B7": "Furnizorii pe care îi utilizăm în acest scop",
    "B8": "X furnizori",
    "B9": "Divulgarea intereselor legitime",
    "B10": "Categorii de date",
    "B11": "Păstrare",
    "B12": "X zile",
    "B13": "Scopurile includ",
    "B14": "Scopul X",
    "B15": "${name} stochează modulele cookie cu o durată maximă de aproximativ atatea zile:",
    "B16": "Aceste module cookie pot fi reactualizate",
    "B17": "Acest furnizor folosește și alte metode, cum ar fi „stocarea locală” și accesul la informațiile de pe dispozitivul dvs.",
    "B18": "${name} folosește și alte metode, cum ar fi „stocarea locală” și accesul la informațiile de pe dispozitivul dvs.",
    "B19": "Alți furnizori"
}