{
    "B2": "Wykorzystujemy pliki cookie i podobne metody do rozpoznawania odwiedzających i zapamiętywania ich preferencji. Możemy także wykorzystywać te technologie do mierzenia skuteczności kampanii reklamowych i reklam celowanych oraz analizowania ruchu w witrynie. Niektóre z tych technologii są konieczne do zapewnienia prawidłowego działania usługi lub witryny i nie mogą być dezaktywowane, a inne są opcjonalne ale służą do zapewnienia większego komfortu użytkownikowi na różne sposoby.\n\nWe współpracy z naszymi partnerami przechowujemy informacje – w tym między innymi adresy IP, niepowtarzalne identyfikatory i dane z przeglądania stron zapisane w plikach cookie – i/ub uzyskujemy do nich dostęp na urządzeniu użytkownika, aby przetwarzać dane osobowe. Mają Państwo możliwość zarządzania swoimi preferencjami przez wybranie opcji „Zarządzaj preferencjami” dostępnej w stopce strony. W celu weryfikacji przypadków, w których nasi partnerzy domagają się uznania uzasadnionego interesu w wykorzystywaniu Państwa danych, lub sprzeciwienia się nim można odwiedzić naszą stronę dla dostawców.",
    "B3": "Dostawcy wykorzystujący zgodę",
    "B4": "Dostawcy wykorzystujący uzasadniony interes",
    "B5": "Dostawcy wykorzystali",
    "B6": "Sprzedaż danych, udostępnianie i reklama celowana",
    "B7": "Dostawcy, z których korzystamy w tym celu",
    "B8": "X dostawca(-y)",
    "B9": "Objaśnienie uzasadnionego interesu",
    "B10": "Kategorie danych",
    "B11": "Przechowywanie",
    "B12": "X dzień/dni",
    "B13": "Rodzaje celów",
    "B14": "Cel X",
    "B15": "${name} przechowuje pliki cookie przez taką przybliżoną maksymalną liczbę dni:",
    "B16": "Te pliki cookie mogą być odświeżane.",
    "B17": "Ten dostawca wykorzystuje także takie metody jak „magazyn lokalny” do przechowywania informacji na Państwa urządzeniu i uzyskiwaniu do nich dostępu.",
    "B18": "${name} wykorzystuje takie metody jak „magazyn lokalny” do przechowywania informacji na Państwa urządzeniu i uzyskiwaniu do nich dostępu.",
    "B19": "Inni dostawcy"
}