{
    "B2": "Aħna nużaw cookies u metodi simili biex nagħrfu l-viżitaturi u niftakru l-preferenzi tagħhom. Nistgħu nużaw ukoll dawn it-teknoloġiji biex inkejlu l-effettività tal-kampanji ta' reklamar, nimmiraw ir-reklami, u nanalizzaw it-traffiku tal-websajt. Xi wħud minn dawn it-teknoloġiji huma essenzjali biex jiġi żgurat il-funzjonament xieraq tas-servizz jew tal-websajt u ma jistgħux jiġu diżattivati, filwaqt li oħrajn mhumiex obbligatorji iżda jservu biex itejbu l-esperjenza tal-utent b'diversi modi.                                                                                                                                                                                                                                           Aħna, f'kollaborazzjoni mas-sħab tagħna, naħżnu u/jew naċċessaw informazzjoni fuq l-apparat ta' utent, inkluż iżda mhux limitat għal indirizzi IP, identifikaturi uniċi, u nibbrawżjaw dejta maħżuna fil-cookies, sabiex nipproċessaw dejta personali. Għandek l-għażla li timmaniġġja l-preferenzi tiegħek billi tagħżel l-għażla 'Immaniġġja l-Preferenzi' li tinsab fil-qiegħ tal-paġna. Biex tirrevedi jew toġġezzjona għal każijiet fejn l-imsieħba tagħna jaffermaw interess leġittimu fl-użu tad-dejta tiegħek, jekk jogħġbok żur il-paġna tal-bejjiegħa tagħna.",
    "B3": "Bejjiegħa li jużaw il-kunsens",
    "B4": "Bejjiegħa li jużaw interess leġittimu",
    "B5": "Bejjiegħa użaw",
    "B6": "Bejgħ tad-Dejta, Qsim u Reklamar Mmirat",
    "B7": "Bejjiegħa li nużaw għal dan il-għan",
    "B8": "X bejjiegħ(a)",
    "B9": "Divulgazzjoni leġittima tal-interess",
    "B10": "Kategoriji tad-dejta",
    "B11": "Ritenzjoni",
    "B12": "X jum(jiem)",
    "B13": "Għanijiet jinkludu",
    "B14": "Għan X",
    "B15": "${name} jaħżen cookies b'tul ta' żmien massimu ta' madwar dil-ġranet:",
    "B16": "Dawn il-cookies jistgħu jiġu aġġornati.",
    "B17": "Dan il-bejjiegħ juża wkoll metodi oħra bħal \"ħażna lokali\" biex jaħżen u jaċċessa informazzjoni fuq l-apparat tiegħek.",
    "B18": "${name} juża metodi bħal \"ħażna lokali\" biex jaħżen u jaċċessa l-informazzjoni fuq it-tagħmir tiegħek.",
    "B19": "Bejjiegħa oħra"
}