{
    "B2": "Utilitzem galetes i mètodes semblants per reconèixer els visitants i recordar-ne les preferències. També podem utilitzar aquestes tecnologies per avaluar l’efectivitat de les campanyes publicitàries, dirigir els anuncis i analitzar el trànsit del lloc web. Algunes d’aquestes tecnologies són essencials per garantir el bon funcionament del servei o lloc web i no es poden desactivar, mentre que d’altres són opcionals però serveixen per millorar l’experiència de l’usuari de diverses maneres.\n\nNosaltres, en col·laboració amb els nostres socis, accedim a informació del dispositiu d’un usuari o l’emmagatzemem. Aquesta informació inclou, entre d’altres, adreces IP, identificadors únics i dades de navegació emmagatzemades a les galetes per processar les dades personals. Podeu gestionar les vostres preferències seleccionant l’opció “Gestiona les preferències” que hi ha al peu de la pàgina. Si voleu revisar o oposar-vos als casos en què els nostres socis afirmen tenir un interès legítim per utilitzar les vostres dades, visiteu la nostra pàgina de proveïdors.",
    "B3": "Proveïdors que utilitzen el consentiment",
    "B4": "Proveïdors que utilitzen l’interès legítim",
    "B5": "Proveïdors utilitzats",
    "B6": "Publicitat dirigida, intercanvi i venda de dades",
    "B7": "Proveïdors que utilitzem per a aquesta finalitat",
    "B8": "X proveïdor(s)",
    "B9": "Declaració sobre els interessos legítims",
    "B10": "Categories de dades",
    "B11": "Retenció",
    "B12": "X dies",
    "B13": "Les finalitats inclouen:",
    "B14": "Finalitat X",
    "B15": "${name} emmagatzema galetes amb una durada màxima d’aproximadament aquest nombre de dies:",
    "B16": "Aquestes galetes es poden actualitzar.",
    "B17": "Aquest proveïdor també utilitza altres mètodes, com ara l’ “emmagatzematge local”, per emmagatzemar i accedir a la informació del vostre dispositiu.",
    "B18": "${name} utilitza mètodes com ara l’“emmagatzematge local” per emmagatzemar i accedir a la informació del vostre dispositiu.",
    "B19": "Altres proveïdors"
}