{
    "B2": "Utilizamos cookies e métodos semelhantes para reconhecer os visitantes e recordar as suas preferências. Também podemos utilizar estas tecnologias para avaliar a eficácia das campanhas publicitárias, direcionar anúncios e analisar o tráfego do website. Algumas destas tecnologias são essenciais para garantir o bom funcionamento do serviço ou do Web site e não podem ser desativadas, enquanto outras são opcionais, mas servem para melhorar a experiência do utilizador de várias formas.\n\nEm colaboração com os nossos parceiros, armazenamos e/ou acedemos a informações no dispositivo de um utilizador, incluindo, entre outros, endereços IP, identificadores únicos e dados de navegação armazenados em cookies, a fim de processar dados pessoais. Tem a opção de gerir as suas preferências selecionando a opção \"Gerir Preferências\" localizada no rodapé da página. Para rever ou opor-se a situações em que os nossos parceiros afirmam ter um interesse legítimo na utilização dos seus dados, visite a nossa página de fornecedores.",
    "B3": "Fornecedores que utilizam o consentimento",
    "B4": "Fornecedores que utilizam o interesse legítimo",
    "B5": "Fornecedores utilizados",
    "B6": "Venda de dados, partilha e publicidade direcionada",
    "B7": "Fornecedores que utilizamos para este fim",
    "B8": "X fornecedor(es)",
    "B9": "Divulgação de interesses legítimos",
    "B10": "Categorias de dados",
    "B11": "Retenção",
    "B12": "X dia(s)",
    "B13": "As finalidades incluem",
    "B14": "Finalidade X",
    "B15": "${name} armazena cookies com uma duração máxima de aproximadamente este número de dias:",
    "B16": "Estes cookies podem ser atualizados.",
    "B17": "Este fornecedor também utiliza outros métodos, como o \"armazenamento local\", para armazenar e aceder a informações no seu dispositivo.",
    "B18": "${name} utiliza métodos, como o \"armazenamento local\", para armazenar e aceder a informações no seu dispositivo.",
    "B19": "Outros fornecedores"
}