{
    "B2": "Възможно е да ги използваме и за измерване на ефективността на рекламните кампании, насочване на рекламите и анализ на трафика на сайта. Възможно е също така да използваме тези технологии, за да измерваме ефективността на рекламните кампании, да насочваме реклами и да анализираме трафика на уебсайта. Някои от тези технологии са от съществено значение за осигуряване на правилното функциониране на услугата или уебсайта и не могат да бъдат деактивирани, докато други не са задължителни, но служат за подобряване на потребителското изживяване по различни начини.\n\nЗа да обработваме лични данни ние, в сътрудничество с нашите партньори, съхраняваме и/или получаваме достъп до информация на устройството на потребителя, включително, но не само, IP адреси, уникални идентификатори и данни за сърфиране, съхранявани в бисквитки. Имате възможност да управлявате предпочитанията си, като изберете опцията “Управление на предпочитанията”, която се намира в долния колонтитул на страницата. За да прегледате или възразите срещу случаите, в които нашите партньори заявяват законен интерес да използват Вашите данни, моля, посетете страницата ни за доставчици.",
    "B3": "Доставчици, използващи съгласие",
    "B4": "Доставчици, използващи законен интерес",
    "B5": "Използвани доставчици",
    "B6": "Продажба на данни, споделяне и целева реклама",
    "B7": "Доставчици, които използваме за тази цел",
    "B8": "X доставчик(ци)",
    "B9": "Законен интерес за оповестяване",
    "B10": "Категории данни",
    "B11": "Съхранение",
    "B12": "X ден(дни)",
    "B13": "Целите включват",
    "B14": "Цел X",
    "B15": "${name} съхранява “бисквитки” с максимална продължителност около този брой дни:",
    "B16": "Тези бисквитки могат да бъдат опреснени.",
    "B17": "Този доставчик използва и други методи като “локално съхранение”, за да съхранява и да получава достъп до информация на Вашето устройство.",
    "B18": "${name} използва методи като “локално съхранение” за съхраняване и достъп до информация на Вашето устройство.",
    "B19": "Други доставчици"
}