{
    "B2": "Χρησιμοποιούμε cookie και παρόμοιες μεθόδους για να αναγνωρίζουμε τους επισκέπτες και να θυμόμαστε τις προτιμήσεις τους. Ενδέχεται επίσης να χρησιμοποιήσουμε αυτές τις τεχνολογίες για να μετρήσουμε την αποτελεσματικότητα των διαφημιστικών εκστρατειών, να στοχεύσουμε διαφημίσεις και να αναλύσουμε την επισκεψιμότητα του ιστότοπου. Ορισμένες από αυτές τις τεχνολογίες είναι απαραίτητες για τη διασφάλιση της σωστής λειτουργίας της υπηρεσίας ή του ιστότοπου και δεν μπορούν να απενεργοποιηθούν, ενώ άλλες είναι προαιρετικές, αλλά χρησιμεύουν για τη βελτίωση της εμπειρίας του χρήστη με διάφορους τρόπους.\n\nΕμείς, σε συνεργασία με τους συνεργάτες μας, αποθηκεύουμε ή/και έχουμε πρόσβαση σε πληροφορίες στη συσκευή ενός χρήστη, συμπεριλαμβανομένων, ενδεικτικά, διευθύνσεων IP, μοναδικών αναγνωριστικών και δεδομένων περιήγησης που είναι αποθηκευμένα σε cookie, προκειμένου να επεξεργαστούμε προσωπικά δεδομένα. Έχετε την επιλογή να διαχειριστείτε τις προτιμήσεις σας επιλέγοντας την επιλογή «Διαχείριση προτιμήσεων» που βρίσκεται στο υποσέλιδο. Για να επιθεωρήσετε ή να εναντιωθείτε σε περιπτώσεις όπου οι συνεργάτες μας ισχυρίζονται ότι έχουν έννομο συμφέρον να χρησιμοποιήσουν τα δεδομένα σας, επισκεφτείτε τη σελίδα των προμηθευτών μας.",
    "B3": "Προμηθευτές που χρησιμοποιούν συναίνεση",
    "B4": "Προμηθευτές που χρησιμοποιούν έννομο συμφέρον",
    "B5": "Προμηθευτές που χρησιμοποιούνται",
    "B6": "Πωλήσεις δεδομένων, κοινοποίηση και στοχευμένες διαφημίσεις",
    "B7": "Προμηθευτές που χρησιμοποιούμε αυτόν τον σκοπό",
    "B8": "X προμηθευτής(-ές)",
    "B9": "Αποκάλυψη έννομου συμφέροντος",
    "B10": "Κατηγορίες δεδομένων",
    "B11": "Διατήρηση",
    "B12": "Χ ημέρα(-ες)",
    "B13": "Οι σκοποί περιλαμβάνουν",
    "B14": "Σκοπός X",
    "B15": "Το ${name} αποθηκεύει cookie με μέγιστη διάρκεια περίπου τόσες ημέρες:",
    "B16": "Αυτά τα cookie ενδέχεται να ανανεωθούν.",
    "B17": "Αυτός ο προμηθευτής χρησιμοποιεί επίσης άλλες μεθόδους, όπως «τοπική αποθήκευση», για την αποθήκευση και την πρόσβαση σε πληροφορίες στη συσκευή σας.",
    "B18": "Το ${name} χρησιμοποιεί μεθόδους όπως η «τοπική αποθήκευση» για την αποθήκευση και την πρόσβαση σε πληροφορίες στη συσκευή σας.",
    "B19": "Λοιποί προμηθευτές"
}